Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(10, 20, 70, 140, 3)]    0         
_________________________________________________________________
zero_padding3d (ZeroPadding3 (10, 22, 70, 140, 3)      0         
_________________________________________________________________
conv3d (Conv3D)              (10, 20, 33, 68, 32)      7200      
_________________________________________________________________
batch_normalization (BatchNo (10, 20, 33, 68, 32)      128       
_________________________________________________________________
spatial_dropout3d (SpatialDr (10, 20, 33, 68, 32)      0         
_________________________________________________________________
max_pooling3d (MaxPooling3D) (10, 20, 16, 34, 32)      0         
_________________________________________________________________
zero_padding3d_1 (ZeroPaddin (10, 22, 16, 34, 32)      0         
_________________________________________________________________
conv3d_1 (Conv3D)            (10, 20, 12, 30, 64)      153600    
_________________________________________________________________
batch_normalization_1 (Batch (10, 20, 12, 30, 64)      256       
_________________________________________________________________
spatial_dropout3d_1 (Spatial (10, 20, 12, 30, 64)      0         
_________________________________________________________________
max_pooling3d_1 (MaxPooling3 (10, 20, 6, 15, 64)       0         
_________________________________________________________________
zero_padding3d_2 (ZeroPaddin (10, 22, 6, 15, 64)       0         
_________________________________________________________________
conv3d_2 (Conv3D)            (10, 20, 4, 13, 96)       165888    
_________________________________________________________________
batch_normalization_2 (Batch (10, 20, 4, 13, 96)       384       
_________________________________________________________________
spatial_dropout3d_2 (Spatial (10, 20, 4, 13, 96)       0         
_________________________________________________________________
max_pooling3d_2 (MaxPooling3 (10, 20, 2, 6, 96)        0         
_________________________________________________________________
time_distributed (TimeDistri (10, 20, 96)              0         
_________________________________________________________________
bidirectional (Bidirectional (10, 20, 512)             543744    
_________________________________________________________________
bidirectional_1 (Bidirection (10, 512)                 1182720   
_________________________________________________________________
dense (Dense)                (10, 10)                  5130      
=================================================================
Total params: 2,059,050
Trainable params: 2,058,666
Non-trainable params: 384
_________________________________________________________________ 
